package object;

public class Animal {
	/**
	 * <オブジェクト指向1>
	 * ※必ずインデントを合わせること。
	 * インデントがわからないなら調べること。
	 * 
	 * if Scanner nextLine for Q1、Q2で区切ってもいい
	 * 外部ファイルから読み込んで
	 * 問1.
	 * if
	 * Scan
	 * 
	 * 問2.クラスファイルをこのファイル含めて2つ以上作ること
	 * インスタンスの生成をする
	 * すべての項目でsetterとgetterを使用すること
	 * 下記を格納するためのフィールドを3つ宣言する
	 * ・String型：動物名
	 * ・double型：体長
	 * ・int型：速度
	 * 
	 * セットする項目
	 * ・ライオン:2.1:80,ゾウ:3.2:40,パンダ:1.9:30,チンパンジー:0.94:25,シマウマ:2.4:65
	 * ・2.1,3.2,1.9,0.94,2.4
	 * ・80,40,30,25,65
	 * 
	 * ・ライオン
	 * ・2.1
	 * ・80
	 * 
	 * ・ゾウ
	 * ・3.2
	 * ・40
	 * 
	 * ・パンダ
	 * ・1.9
	 * ・30
	 * 
	 * ・チンパンジー
	 * ・0.94
	 * ・25
	 * 
	 * ・シマウマ
	 * ・2.4
	 * ・65
	 * 
	 * コンソールには下記の通り改行して出力してください
	 * ・動物名：○○
	 * ・体長：〇.〇m
	 * ・速度：○○km
	 * 
	 * ・動物名：○○
	 * ・体長：〇.〇m
	 * ・速度：○○km
	 * 
	 * ・動物名：○○
	 * ・体長：〇.〇m
	 * ・速度：○○km
	 * 
	 * ・動物名：○○
	 * ・体長：〇.〇m
	 * ・速度：○○km
	 * 
	 * ・動物名：○○
	 * ・体長：〇.〇m
	 * ・速度：○○km
	 * */
//	まーきの
// どらえもん
}
